result/pubsub-11k-1593690823.txt
wrk -t 4 -c 20 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  4 threads and 20 connections
  Thread calibration: mean lat.: 1.246ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.294ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.274ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.262ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.19ms  453.19us   2.51ms   66.80%
    Req/Sec   130.33     88.69   333.00     62.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.46ms
 90.000%    1.85ms
 99.000%    2.31ms
 99.900%    2.45ms
 99.990%    2.50ms
 99.999%    2.52ms
100.000%    2.52ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.419     0.000000            1         1.00
       0.612     0.100000          999         1.11
       0.756     0.200000         2001         1.25
       0.890     0.300000         2998         1.43
       1.033     0.400000         3992         1.67
       1.167     0.500000         4993         2.00
       1.229     0.550000         5490         2.22
       1.290     0.600000         5993         2.50
       1.350     0.650000         6492         2.86
       1.407     0.700000         6992         3.33
       1.463     0.750000         7491         4.00
       1.492     0.775000         7742         4.44
       1.523     0.800000         7992         5.00
       1.558     0.825000         8234         5.71
       1.622     0.850000         8483         6.67
       1.735     0.875000         8733         8.00
       1.794     0.887500         8859         8.89
       1.849     0.900000         8984        10.00
       1.906     0.912500         9109        11.43
       1.955     0.925000         9234        13.33
       2.014     0.937500         9357        16.00
       2.049     0.943750         9421        17.78
       2.093     0.950000         9488        20.00
       2.131     0.956250         9545        22.86
       2.173     0.962500         9612        26.67
       2.203     0.968750         9669        32.00
       2.217     0.971875         9701        35.56
       2.233     0.975000         9731        40.00
       2.251     0.978125         9765        45.71
       2.261     0.981250         9797        53.33
       2.275     0.984375         9828        64.00
       2.281     0.985938         9842        71.11
       2.291     0.987500         9859        80.00
       2.303     0.989062         9871        91.43
       2.321     0.990625         9889       106.67
       2.341     0.992188         9905       128.00
       2.351     0.992969         9910       142.22
       2.365     0.993750         9918       160.00
       2.379     0.994531         9926       182.86
       2.389     0.995313         9935       213.33
       2.399     0.996094         9942       256.00
       2.401     0.996484         9945       284.44
       2.405     0.996875         9949       320.00
       2.425     0.997266         9953       365.71
       2.431     0.997656         9959       426.67
       2.435     0.998047         9962       512.00
       2.437     0.998242         9964       568.89
       2.441     0.998437         9965       640.00
       2.449     0.998633         9967       731.43
       2.455     0.998828         9970       853.33
       2.457     0.999023         9971      1024.00
       2.467     0.999121         9972      1137.78
       2.469     0.999219         9973      1280.00
       2.471     0.999316         9974      1462.86
       2.473     0.999414         9975      1706.67
       2.483     0.999512         9976      2048.00
       2.483     0.999561         9976      2275.56
       2.487     0.999609         9978      2560.00
       2.487     0.999658         9978      2925.71
       2.487     0.999707         9978      3413.33
       2.487     0.999756         9978      4096.00
       2.487     0.999780         9978      4551.11
       2.503     0.999805         9979      5120.00
       2.503     0.999829         9979      5851.43
       2.503     0.999854         9979      6826.67
       2.503     0.999878         9979      8192.00
       2.503     0.999890         9979      9102.22
       2.515     0.999902         9980     10240.00
       2.515     1.000000         9980          inf
#[Mean    =        1.191, StdDeviation   =        0.453]
#[Max     =        2.514, Total count    =         9980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15004 requests in 30.00s, 159.88MB read
Requests/sec:    500.11
Transfer/sec:      5.33MB
wrk -t 4 -c 100 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.187ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.541ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.212ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.210ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  428.51us   3.23ms   69.86%
    Req/Sec   131.69    306.04     2.78k    98.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.27ms
 75.000%    1.52ms
 90.000%    1.80ms
 99.000%    2.52ms
 99.900%    3.01ms
 99.990%    3.22ms
 99.999%    3.23ms
100.000%    3.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.435     0.000000            2         1.00
       0.713     0.100000          992         1.11
       0.899     0.200000         1988         1.25
       1.041     0.300000         2975         1.43
       1.166     0.400000         3964         1.67
       1.274     0.500000         4950         2.00
       1.323     0.550000         5451         2.22
       1.373     0.600000         5955         2.50
       1.420     0.650000         6441         2.86
       1.471     0.700000         6935         3.33
       1.524     0.750000         7429         4.00
       1.552     0.775000         7677         4.44
       1.582     0.800000         7923         5.00
       1.620     0.825000         8169         5.71
       1.670     0.850000         8418         6.67
       1.729     0.875000         8667         8.00
       1.765     0.887500         8787         8.89
       1.804     0.900000         8915        10.00
       1.839     0.912500         9036        11.43
       1.887     0.925000         9158        13.33
       1.950     0.937500         9284        16.00
       1.980     0.943750         9344        17.78
       2.020     0.950000         9408        20.00
       2.063     0.956250         9467        22.86
       2.121     0.962500         9531        26.67
       2.187     0.968750         9591        32.00
       2.229     0.971875         9623        35.56
       2.271     0.975000         9653        40.00
       2.313     0.978125         9684        45.71
       2.341     0.981250         9716        53.33
       2.393     0.984375         9746        64.00
       2.425     0.985938         9763        71.11
       2.457     0.987500         9778        80.00
       2.493     0.989062         9793        91.43
       2.547     0.990625         9808       106.67
       2.617     0.992188         9823       128.00
       2.649     0.992969         9831       142.22
       2.683     0.993750         9839       160.00
       2.729     0.994531         9846       182.86
       2.749     0.995313         9854       213.33
       2.783     0.996094         9862       256.00
       2.807     0.996484         9866       284.44
       2.823     0.996875         9870       320.00
       2.837     0.997266         9873       365.71
       2.895     0.997656         9877       426.67
       2.923     0.998047         9881       512.00
       2.941     0.998242         9883       568.89
       2.945     0.998437         9886       640.00
       2.951     0.998633         9887       731.43
       3.003     0.998828         9889       853.33
       3.017     0.999023         9891      1024.00
       3.047     0.999121         9892      1137.78
       3.063     0.999219         9894      1280.00
       3.063     0.999316         9894      1462.86
       3.075     0.999414         9895      1706.67
       3.077     0.999512         9896      2048.00
       3.077     0.999561         9896      2275.56
       3.079     0.999609         9897      2560.00
       3.079     0.999658         9897      2925.71
       3.151     0.999707         9898      3413.33
       3.151     0.999756         9898      4096.00
       3.151     0.999780         9898      4551.11
       3.219     0.999805         9899      5120.00
       3.219     0.999829         9899      5851.43
       3.219     0.999854         9899      6826.67
       3.219     0.999878         9899      8192.00
       3.219     0.999890         9899      9102.22
       3.227     0.999902         9900     10240.00
       3.227     1.000000         9900          inf
#[Mean    =        1.277, StdDeviation   =        0.429]
#[Max     =        3.226, Total count    =         9900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14880 requests in 30.00s, 158.55MB read
Requests/sec:    495.97
Transfer/sec:      5.28MB
wrk -t 4 -c 500 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  4 threads and 500 connections
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 13.389ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 26.082ms, rate sampling interval: 146ms
  Thread calibration: mean lat.: 70.671ms, rate sampling interval: 537ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.42ms  519.48us   3.25ms   66.97%
    Req/Sec    64.11    363.35     4.67k    98.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.73ms
 90.000%    2.17ms
 99.000%    2.79ms
 99.900%    3.11ms
 99.990%    3.26ms
 99.999%    3.26ms
100.000%    3.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.473     0.000000            1         1.00
       0.760     0.100000          439         1.11
       0.952     0.200000          872         1.25
       1.122     0.300000         1308         1.43
       1.250     0.400000         1743         1.67
       1.357     0.500000         2176         2.00
       1.417     0.550000         2395         2.22
       1.479     0.600000         2613         2.50
       1.547     0.650000         2829         2.86
       1.636     0.700000         3049         3.33
       1.726     0.750000         3267         4.00
       1.775     0.775000         3373         4.44
       1.836     0.800000         3481         5.00
       1.915     0.825000         3592         5.71
       1.984     0.850000         3701         6.67
       2.075     0.875000         3808         8.00
       2.127     0.887500         3863         8.89
       2.171     0.900000         3917        10.00
       2.221     0.912500         3971        11.43
       2.273     0.925000         4026        13.33
       2.325     0.937500         4080        16.00
       2.355     0.943750         4107        17.78
       2.393     0.950000         4135        20.00
       2.425     0.956250         4162        22.86
       2.475     0.962500         4190        26.67
       2.533     0.968750         4217        32.00
       2.553     0.971875         4229        35.56
       2.579     0.975000         4243        40.00
       2.605     0.978125         4256        45.71
       2.661     0.981250         4270        53.33
       2.715     0.984375         4286        64.00
       2.723     0.985938         4290        71.11
       2.739     0.987500         4298        80.00
       2.775     0.989062         4305        91.43
       2.801     0.990625         4311       106.67
       2.831     0.992188         4318       128.00
       2.861     0.992969         4321       142.22
       2.883     0.993750         4324       160.00
       2.915     0.994531         4328       182.86
       2.937     0.995313         4331       213.33
       2.959     0.996094         4335       256.00
       2.963     0.996484         4336       284.44
       2.967     0.996875         4338       320.00
       3.047     0.997266         4341       365.71
       3.047     0.997656         4341       426.67
       3.055     0.998047         4343       512.00
       3.057     0.998242         4344       568.89
       3.073     0.998437         4345       640.00
       3.085     0.998633         4346       731.43
       3.085     0.998828         4346       853.33
       3.109     0.999023         4347      1024.00
       3.141     0.999121         4348      1137.78
       3.141     0.999219         4348      1280.00
       3.195     0.999316         4349      1462.86
       3.195     0.999414         4349      1706.67
       3.195     0.999512         4349      2048.00
       3.235     0.999561         4350      2275.56
       3.235     0.999609         4350      2560.00
       3.235     0.999658         4350      2925.71
       3.235     0.999707         4350      3413.33
       3.235     0.999756         4350      4096.00
       3.255     0.999780         4351      4551.11
       3.255     1.000000         4351          inf
#[Mean    =        1.419, StdDeviation   =        0.519]
#[Max     =        3.254, Total count    =         4351]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7127 requests in 30.09s, 75.94MB read
  Socket errors: connect 0, read 0, write 0, timeout 3444
Requests/sec:    236.85
Transfer/sec:      2.52MB
wrk -t 4 -c 1000 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  4 threads and 1000 connections
  Thread calibration: mean lat.: 509.683ms, rate sampling interval: 4009ms
  Thread calibration: mean lat.: 1746.700ms, rate sampling interval: 11976ms
  Thread calibration: mean lat.: 1350.288ms, rate sampling interval: 11403ms
  Thread calibration: mean lat.: 1126.951ms, rate sampling interval: 8015ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.60ms  726.58ms  14.35s    99.38%
    Req/Sec    45.88      4.75    55.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.57ms
 75.000%    1.97ms
 90.000%    2.37ms
 99.000%    3.40ms
 99.900%   12.35s 
 99.990%   14.36s 
 99.999%   14.36s 
100.000%   14.36s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.581     0.000000            1         1.00
       0.828     0.100000          340         1.11
       1.082     0.200000          680         1.25
       1.272     0.300000         1021         1.43
       1.436     0.400000         1358         1.67
       1.572     0.500000         1698         2.00
       1.645     0.550000         1867         2.22
       1.725     0.600000         2037         2.50
       1.792     0.650000         2208         2.86
       1.869     0.700000         2376         3.33
       1.966     0.750000         2546         4.00
       2.021     0.775000         2631         4.44
       2.079     0.800000         2718         5.00
       2.135     0.825000         2801         5.71
       2.211     0.850000         2886         6.67
       2.285     0.875000         2973         8.00
       2.317     0.887500         3014         8.89
       2.365     0.900000         3055        10.00
       2.423     0.912500         3098        11.43
       2.477     0.925000         3141        13.33
       2.541     0.937500         3183        16.00
       2.573     0.943750         3204        17.78
       2.617     0.950000         3225        20.00
       2.669     0.956250         3246        22.86
       2.715     0.962500         3269        26.67
       2.785     0.968750         3288        32.00
       2.817     0.971875         3299        35.56
       2.871     0.975000         3310        40.00
       2.937     0.978125         3320        45.71
       3.001     0.981250         3331        53.33
       3.109     0.984375         3341        64.00
       3.137     0.985938         3348        71.11
       3.157     0.987500         3352        80.00
       3.295     0.989062         3357        91.43
       3.451     0.990625         3363       106.67
       3.759     0.992188         3368       128.00
     356.863     0.992969         3371       142.22
     357.375     0.993750         3373       160.00
    2357.247     0.994531         3376       182.86
    4358.143     0.995313         3379       213.33
    6356.991     0.996094         3382       256.00
    8355.839     0.996484         3385       284.44
    8355.839     0.996875         3385       320.00
    8355.839     0.997266         3385       365.71
   10354.687     0.997656         3388       426.67
   10354.687     0.998047         3388       512.00
   12353.535     0.998242         3391       568.89
   12353.535     0.998437         3391       640.00
   12353.535     0.998633         3391       731.43
   12353.535     0.998828         3391       853.33
   12353.535     0.999023         3391      1024.00
   14352.383     0.999121         3392      1137.78
   14352.383     0.999219         3392      1280.00
   14352.383     0.999316         3392      1462.86
   14360.575     0.999414         3394      1706.67
   14360.575     1.000000         3394          inf
#[Mean    =       53.596, StdDeviation   =      726.581]
#[Max     =    14352.384, Total count    =         3394]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7655 requests in 31.00s, 81.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 7211
Requests/sec:    246.90
Transfer/sec:      2.63MB
wrk -t 10 -c 20 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  10 threads and 20 connections
  Thread calibration: mean lat.: 1.160ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.244ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.176ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.348ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.349ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.179ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.208ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.354ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.324ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.172ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms  329.74us   2.48ms   63.07%
    Req/Sec    52.39     73.11   222.00     87.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.33ms
 90.000%    1.49ms
 99.000%    2.01ms
 99.900%    2.38ms
 99.990%    2.47ms
 99.999%    2.48ms
100.000%    2.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.404     0.000000            1         1.00
       0.660     0.100000         1000         1.11
       0.761     0.200000         1997         1.25
       0.866     0.300000         3000         1.43
       0.975     0.400000         4002         1.67
       1.076     0.500000         4990         2.00
       1.131     0.550000         5490         2.22
       1.179     0.600000         5990         2.50
       1.226     0.650000         6492         2.86
       1.275     0.700000         6991         3.33
       1.330     0.750000         7487         4.00
       1.360     0.775000         7739         4.44
       1.388     0.800000         7985         5.00
       1.417     0.825000         8244         5.71
       1.440     0.850000         8485         6.67
       1.465     0.875000         8746         8.00
       1.478     0.887500         8858         8.89
       1.494     0.900000         8985        10.00
       1.508     0.912500         9114        11.43
       1.523     0.925000         9237        13.33
       1.542     0.937500         9360        16.00
       1.553     0.943750         9422        17.78
       1.566     0.950000         9483        20.00
       1.577     0.956250         9546        22.86
       1.589     0.962500         9606        26.67
       1.614     0.968750         9670        32.00
       1.631     0.971875         9700        35.56
       1.652     0.975000         9731        40.00
       1.715     0.978125         9762        45.71
       1.802     0.981250         9793        53.33
       1.890     0.984375         9825        64.00
       1.937     0.985938         9840        71.11
       1.975     0.987500         9857        80.00
       2.000     0.989062         9871        91.43
       2.015     0.990625         9888       106.67
       2.042     0.992188         9903       128.00
       2.065     0.992969         9910       142.22
       2.099     0.993750         9918       160.00
       2.173     0.994531         9926       182.86
       2.227     0.995313         9934       213.33
       2.253     0.996094         9942       256.00
       2.269     0.996484         9945       284.44
       2.309     0.996875         9950       320.00
       2.313     0.997266         9954       365.71
       2.319     0.997656         9957       426.67
       2.335     0.998047         9961       512.00
       2.341     0.998242         9963       568.89
       2.351     0.998437         9966       640.00
       2.355     0.998633         9968       731.43
       2.363     0.998828         9969       853.33
       2.377     0.999023         9971      1024.00
       2.383     0.999121         9972      1137.78
       2.389     0.999219         9973      1280.00
       2.425     0.999316         9974      1462.86
       2.439     0.999414         9975      1706.67
       2.449     0.999512         9976      2048.00
       2.449     0.999561         9976      2275.56
       2.455     0.999609         9977      2560.00
       2.455     0.999658         9977      2925.71
       2.469     0.999707         9979      3413.33
       2.469     0.999756         9979      4096.00
       2.469     0.999780         9979      4551.11
       2.469     0.999805         9979      5120.00
       2.469     0.999829         9979      5851.43
       2.469     0.999854         9979      6826.67
       2.469     0.999878         9979      8192.00
       2.469     0.999890         9979      9102.22
       2.485     0.999902         9980     10240.00
       2.485     1.000000         9980          inf
#[Mean    =        1.084, StdDeviation   =        0.330]
#[Max     =        2.484, Total count    =         9980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15010 requests in 30.00s, 159.94MB read
Requests/sec:    500.32
Transfer/sec:      5.33MB
wrk -t 10 -c 100 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25ms  402.89us   2.39ms   64.73%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.52ms
 90.000%    1.79ms
 99.000%    2.11ms
 99.900%    2.34ms
 99.990%    2.39ms
 99.999%    2.39ms
100.000%    2.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.405     0.000000            2         1.00
       0.660     0.100000          410         1.11
       0.865     0.200000          823         1.25
       1.041     0.300000         1230         1.43
       1.177     0.400000         1643         1.67
       1.277     0.500000         2050         2.00
       1.322     0.550000         2256         2.22
       1.373     0.600000         2465         2.50
       1.415     0.650000         2666         2.86
       1.463     0.700000         2870         3.33
       1.517     0.750000         3076         4.00
       1.547     0.775000         3179         4.44
       1.577     0.800000         3281         5.00
       1.625     0.825000         3383         5.71
       1.677     0.850000         3486         6.67
       1.728     0.875000         3588         8.00
       1.758     0.887500         3639         8.89
       1.795     0.900000         3692        10.00
       1.825     0.912500         3744        11.43
       1.852     0.925000         3793        13.33
       1.880     0.937500         3845        16.00
       1.897     0.943750         3870        17.78
       1.914     0.950000         3895        20.00
       1.935     0.956250         3921        22.86
       1.966     0.962500         3947        26.67
       1.996     0.968750         3972        32.00
       2.009     0.971875         3987        35.56
       2.024     0.975000         3999        40.00
       2.038     0.978125         4012        45.71
       2.061     0.981250         4025        53.33
       2.071     0.984375         4036        64.00
       2.089     0.985938         4043        71.11
       2.097     0.987500         4049        80.00
       2.109     0.989062         4059        91.43
       2.121     0.990625         4062       106.67
       2.145     0.992188         4069       128.00
       2.161     0.992969         4072       142.22
       2.169     0.993750         4076       160.00
       2.177     0.994531         4079       182.86
       2.187     0.995313         4081       213.33
       2.209     0.996094         4084       256.00
       2.217     0.996484         4086       284.44
       2.227     0.996875         4088       320.00
       2.241     0.997266         4089       365.71
       2.251     0.997656         4091       426.67
       2.273     0.998047         4092       512.00
       2.297     0.998242         4093       568.89
       2.303     0.998437         4094       640.00
       2.311     0.998633         4095       731.43
       2.339     0.998828         4096       853.33
       2.339     0.999023         4096      1024.00
       2.357     0.999121         4097      1137.78
       2.357     0.999219         4097      1280.00
       2.365     0.999316         4098      1462.86
       2.365     0.999414         4098      1706.67
       2.365     0.999512         4098      2048.00
       2.381     0.999561         4099      2275.56
       2.381     0.999609         4099      2560.00
       2.381     0.999658         4099      2925.71
       2.381     0.999707         4099      3413.33
       2.381     0.999756         4099      4096.00
       2.393     0.999780         4100      4551.11
       2.393     1.000000         4100          inf
#[Mean    =        1.251, StdDeviation   =        0.403]
#[Max     =        2.392, Total count    =         4100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4100 requests in 8.05s, 43.69MB read
Requests/sec:    509.22
Transfer/sec:      5.43MB
wrk -t 10 -c 500 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  10 threads and 500 connections
  Thread calibration: mean lat.: 0.666ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.662ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.631ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.673ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.684ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.692ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  186 requests in 30.26s, 1.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 7314
Requests/sec:      6.15
Transfer/sec:     67.07KB
wrk -t 10 -c 1000 -d30s -R 500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  10 threads and 1000 connections
  Thread calibration: mean lat.: 1.223ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.174ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.195ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 258.856ms, rate sampling interval: 2059ms
  Thread calibration: mean lat.: 1.184ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 229.701ms, rate sampling interval: 2059ms
  Thread calibration: mean lat.: 1.209ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 286.405ms, rate sampling interval: 2059ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms  413.15us   2.78ms   67.58%
    Req/Sec    34.09     79.44   555.00     84.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.50ms
 90.000%    1.77ms
 99.000%    2.29ms
 99.900%    2.58ms
 99.990%    2.79ms
 99.999%    2.79ms
100.000%    2.79ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.417     0.000000            1         1.00
       0.683     0.100000          472         1.11
       0.842     0.200000          944         1.25
       0.991     0.300000         1416         1.43
       1.120     0.400000         1889         1.67
       1.236     0.500000         2360         2.00
       1.286     0.550000         2596         2.22
       1.340     0.600000         2834         2.50
       1.398     0.650000         3072         2.86
       1.449     0.700000         3305         3.33
       1.499     0.750000         3543         4.00
       1.527     0.775000         3659         4.44
       1.558     0.800000         3776         5.00
       1.589     0.825000         3896         5.71
       1.626     0.850000         4013         6.67
       1.699     0.875000         4130         8.00
       1.731     0.887500         4190         8.89
       1.774     0.900000         4248        10.00
       1.813     0.912500         4307        11.43
       1.859     0.925000         4366        13.33
       1.908     0.937500         4425        16.00
       1.938     0.943750         4456        17.78
       1.963     0.950000         4485        20.00
       2.000     0.956250         4514        22.86
       2.032     0.962500         4545        26.67
       2.067     0.968750         4574        32.00
       2.087     0.971875         4590        35.56
       2.113     0.975000         4602        40.00
       2.151     0.978125         4617        45.71
       2.183     0.981250         4633        53.33
       2.231     0.984375         4647        64.00
       2.251     0.985938         4654        71.11
       2.263     0.987500         4661        80.00
       2.275     0.989062         4670        91.43
       2.293     0.990625         4676       106.67
       2.339     0.992188         4684       128.00
       2.345     0.992969         4687       142.22
       2.357     0.993750         4691       160.00
       2.369     0.994531         4695       182.86
       2.403     0.995313         4698       213.33
       2.429     0.996094         4704       256.00
       2.429     0.996484         4704       284.44
       2.437     0.996875         4706       320.00
       2.463     0.997266         4708       365.71
       2.477     0.997656         4709       426.67
       2.489     0.998047         4711       512.00
       2.519     0.998242         4712       568.89
       2.529     0.998437         4713       640.00
       2.535     0.998633         4714       731.43
       2.579     0.998828         4715       853.33
       2.593     0.999023         4716      1024.00
       2.593     0.999121         4716      1137.78
       2.595     0.999219         4717      1280.00
       2.595     0.999316         4717      1462.86
       2.615     0.999414         4718      1706.67
       2.615     0.999512         4718      2048.00
       2.615     0.999561         4718      2275.56
       2.671     0.999609         4719      2560.00
       2.671     0.999658         4719      2925.71
       2.671     0.999707         4719      3413.33
       2.671     0.999756         4719      4096.00
       2.671     0.999780         4719      4551.11
       2.785     0.999805         4720      5120.00
       2.785     1.000000         4720          inf
#[Mean    =        1.234, StdDeviation   =        0.413]
#[Max     =        2.784, Total count    =         4720]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7835 requests in 30.52s, 83.49MB read
  Socket errors: connect 0, read 0, write 0, timeout 6880
Requests/sec:    256.71
Transfer/sec:      2.74MB